RyanMcB8/BB8_STM32/Firmware/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32wbxx_hal.h"

#include "app_conf.h"
#include "app_entry.h"
#include "app_common.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "motionControl.h"
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define MOTOR2_FAULT_Pin GPIO_PIN_13
#define MOTOR2_FAULT_GPIO_Port GPIOC
#define MOTOR1_STEP_Pin GPIO_PIN_0
#define MOTOR1_STEP_GPIO_Port GPIOA
#define MOTOR2_EN_BAR_Pin GPIO_PIN_8
#define MOTOR2_EN_BAR_GPIO_Port GPIOA
#define MOTOR1_FAULT_Pin GPIO_PIN_10
#define MOTOR1_FAULT_GPIO_Port GPIOA
#define MOTOR2_STEP_Pin GPIO_PIN_11
#define MOTOR2_STEP_GPIO_Port GPIOA
#define MOTOR2_DIR_Pin GPIO_PIN_15
#define MOTOR2_DIR_GPIO_Port GPIOA
#define MOTOR1_EN_BAR_Pin GPIO_PIN_0
#define MOTOR1_EN_BAR_GPIO_Port GPIOD
#define MOTOR1_DIR_Pin GPIO_PIN_1
#define MOTOR1_DIR_GPIO_Port GPIOD

/* USER CODE BEGIN Private defines */

/* Adding a struct for the motor power. */

/** @brief A struct which is used to store the analogue data received
 * from the controller or by over BLE.
 */
typedef struct{
  float forward_backward;
  float left_right;
} joyStick_values_t;

extern joyStick_values_t joyStickValues; 
extern MotorPWMChannels_t motorPWMChannels;


/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
